import { HistoryBlockProps } from '@components/History/interfaces'

const HISTORY_INFO: HistoryBlockProps[] = [
  {
    year: '1887',
    text: `Митрофан Лагидзе создал собственное предприятие и открыл в Кутаиси производство лимонадов на основе натуральных сиропов. Напитки, стоимостью 20 копеек за бутылку, мгновенно стали популярными.`,
  },
  {
    year: '1900',
    text: `Маленькое производство превратилось в завод. Лагизде трепетно относился к соблюдению рецептуры напитков и строго следил за тем, чтобы все травы, ягоды и фрукты для сиропов собирались в определённых районах Грузии: от этого зависел вкус лимонадов и их репутация.`,
  },
  {
    year: '1906',
    text: `Пришло время улучшить производство лимонадов. Митрофан переехал в Тбилиси, где открыл новый завод, а также легендарный магазин «Вода Лагидзе» на проспекте Руставели. Магазин стал культовым местом: вечерами у него собиралась грузинская интеллигенция для того, чтобы пообщаться и утолить жажду лимонадами. `,
  },
  {
    year: `
      1906 
      - 
      1921
    `,
    text: `Расцвет «лимонадной империи» Лагидзе: напитки приобрели популярность за пределами Грузии и завоевали награды на российских и международных выставках. Сотрудничая с французскими специалистами по рекламе, напитки получили одобрение, а Митрофан стал поставщиком российского императорского двора.`,
  },
  {
    year: '1921',
    text: `В результате пожара детище Лагидзе было уничтожено. Однако Митрофан не смог оставить поклонников «Воды Лагизде» без любимых напитков и возобновил производство в подвале собственного дома, где в течение нескольких лет собственноручно варил сиропы и разливал лимонады. Тем временем началось строительство нового завода.`,
  },
  {
    year: '1927',
    text: `Строительство нового завода в Тбилиси завершено. Предприятие оснащено по последнему слову техники, Митрофан Лагидзе стал директором завода и возобновил выпуск продукции в новых масштабах.`,
  },
  {
    year: '1934',
    text: `Митрофан Лагидзе впервые в Грузии освоил промышленное производство углекислого газа. `,
  },
  {
    year: '1943',
    text: `Знаменитая Тегеранская конференция оказалась знаковой в истории бренда: на столе переговоров, стояли лимонады «Вода Лагидзе». Рузвельт был настолько впечатлён вкусом и ароматом лимонадов, что увёз 2000 бутылок с собой на Родину. Черчилль описал вкус лимонадов в книге мемуаров «Тегеран 43».`,
  },
  {
    year: '1952',
    text: `
      Митрофан Лагидзе был назначен главным консультантом «Главфруктвода» в министерстве пищевой промышленности СССР. Производство лимонадов в СССР было основано на рецептах Лагидзе.
   
      Также в 1952 году состоялась знаменитая «лимонадная война», которая началась с того, что Президент США Гарри Трумэн прислал Сталину в подарок 1000 бутылок Coca-Cola. Напиток пришелся по вкусу советской власти, однако Сталин захотел дать Америке достойный ответ: лимонад был отправлен американскому президенту.
    `,
  },
  {
    year: '2004',
    text: `Под руководством Малхаза Дзимистаришвили начался выпуск продукции «Митрофан Лагидзе» на арендованных для производства площадях, а также запускается строительство нового завода. Легендарный бренд с вековой историей начал возрождаться.`,
  },
  {
    year: '2011',
    text: `Было завершено строительство Тихвинского Лимонадного Завода, который сегодня является одним из самых современных и высокотехнологичных производственных предприятий России с принадлежащими ему эксклюзивными правами на производство и продажу лимонадов.`,
  },
]

export default HISTORY_INFO
